In [1]:
#map - is to iterate a list or tuple over a function in python
#map(func,list/tuple)

people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

def split_title_and_name(person):
    return person.split(' ')[0]+person.split(' ')[-1]

list(map(split_title_and_name,people))

['Dr.Brooks', 'Dr.Collins-Thompson', 'Dr.Vydiswaran', 'Dr.Romero']

In [2]:
#Difference between '+' and .format is that fir '+' concatinate only works if both the values are string or we else we need use str function to convert any numberic into a string but for .format we can pass any values like int or float and print them.

print('I am a number ' + str(3))
print('{} {}'.format('I am a number',3))

I am a number 3
I am a number 3

In [3]:
people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

def split_title_and_name(person):
    return person.split()[0] + ' ' + person.split()[-1]

#option 1
for person in people:
    print(split_title_and_name(person) == (lambda person : person.split()[0] + ' ' + person.split()[-1]))

#option 2
list(map(split_title_and_name, people)) == list(map(lambda person:person.split()[0] + ' ' + person.split()[-1],people))

False
False
False
False

True

In [4]:
# lambda is a one line function which requires parameters to be passed  either directly or using Map function

for person in people:
    print((lambda person : person.split()[0] + ' ' + person.split()[-1])(person))

people = ['Dr. Christopher Brooks', 'Dr. Kevyn Collins-Thompson', 'Dr. VG Vinod Vydiswaran', 'Dr. Daniel Romero']

def split_title_and_name(person):
    return person.split()[0] + ' ' + person.split()[-1]

#option 1
for person in people:
    print(split_title_and_name(person) == (lambda x: x.split()[0] + ' ' + x.split()[-1])(person))

#option 2
list(map(split_title_and_name, people)) == list(map(lambda person: person.split()[0] + ' ' + person.split()[-1], people))

Dr. Brooks
Dr. Collins-Thompson
Dr. Vydiswaran
Dr. Romero
True
True
True
True

True

In [5]:
def times_tables():
    lst = []
    for i in range(10):
        for j in range (10):
            lst.append(i*j)
    return lst

times_tables() == [i*j for i in range(10) for j in range(10)]

print([i*j for i in range(10) for j in range(10)])

[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 0, 3, 6, 9, 12, 15, 18, 21, 24, 27, 0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 0, 6, 12, 18, 24, 30, 36, 42, 48, 54, 0, 7, 14, 21, 28, 35, 42, 49, 56, 63, 0, 8, 16, 24, 32, 40, 48, 56, 64, 72, 0, 9, 18, 27, 36, 45, 54, 63, 72, 81]

In [22]:
#Many organizations have user ids which are constrained in some way. 
#Imagine you work at an internet service provider and the user ids are all two letters followed by two numbers (e.g. aa49). 
#Your task at such an organization might be to hold a record on the billing activity for each possible user.

#Write an initialization line as a single list comprehension which creates a list of all possible user ids. 
#Assume the letters are all lower case.

lowercase = 'abcdefghijklmnopqrstuvwxyz'
digits = '0123456789'

#answer = [i+j for i in lowercase for j in lowercase]

answer = [i+j+k+l for i in lowercase for j in lowercase for k in digits for l in digits]
print(answer[0:5])

['aa00', 'aa01', 'aa02', 'aa03', 'aa04']

In [23]:
# Enumerate - default counter

words = ['asdfd','asdf']

for i,j in enumerate(words):
    print(i)
    print(j)

0
asdfd
1
asdf

In [24]:
# zip is used to map two list
name = [ "Manjeet", "Nikhil", "Shambhavi", "Astha" ] 
roll_no = [ 4, 1, 3, 2 ] 
marks = [ 40, 50, 60, 70 ] 
  
# using zip() to map values 
mapped = zip(name, roll_no, marks) 
  
# converting values to print as list 
mapped = list(mapped) 
  
# printing resultant values  
print ("The zipped result is : ",end="") 
print (mapped)

The zipped result is : [('Manjeet', 4, 40), ('Nikhil', 1, 50), ('Shambhavi', 3, 60), ('Astha', 2, 70)]

In [2]:
#iterate series
import pandas as pd
import numpy as np
import random

iloc takes index position and loc takes the index value to return the value.
These are attributes and take square brackets. these are not methods

set_value is used to set values an index with a value in numpy. we should think if it is the best way to iterate a series or use any functions to get the same functionality which is parallel processing

In [ ]:
%%timeit -n 100
summary = 0
s = pd.Series(np.random.randint(0,1000,1000))
for label, value in s.iteritems():
    s.loc[label]=value+2

In [ ]:
%%timeit -n 100
s += 2

reduce chaining while retrieveing the data

In [4]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

df['Item Purchased']

Store 1        Dog Food
Store 1    Kitty Litter
Store 2       Bird Seed
Name: Item Purchased, dtype: object

In [6]:
df[(df['Cost']>3)]['Name']

Store 1    Chris
Store 2    Vinod
Name: Name, dtype: object

Boolean Masking - Numpy and Pandas are built on this it is a datastructure with True or false values
dropna - to drop all the nan

In [33]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])

In [34]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [35]:
df['Location'] = df.index

In [36]:
df = df.reset_index()

In [37]:
df

     index   Name Item Purchased  Cost Location
0  Store 1  Chris       Dog Food  22.5  Store 1
1  Store 1  Kevyn   Kitty Litter   2.5  Store 1
2  Store 2  Vinod      Bird Seed   5.0  Store 2

In [38]:
df = df.drop('index', axis = 1)

In [39]:
df

    Name Item Purchased  Cost Location
0  Chris       Dog Food  22.5  Store 1
1  Kevyn   Kitty Litter   2.5  Store 1
2  Vinod      Bird Seed   5.0  Store 2

In [40]:
df = df.set_index(['Location','Name'])

In [41]:
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [42]:
purchase_4 = pd.Series({'Location':'Store 2',
                        'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Food',
                        'Cost': 3.00})

In [43]:
df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))

In [44]:
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0

In [45]:
product = pd.DataFrame([{'Product_Id':4109,'Price':5.0,'Product':'Sushi Roll'},
                        {'Product_Id':1412,'Price':0.5,'Product':'Egg'},
                        {'Product_Id':8931,'Price':1.5,'Product':'Bagel'}])

invoice = pd.DataFrame([{'Customer':'Ali','Product_Id':4109,'Quantity':1},
                        {'Customer':'Eric','Product_Id':1412,'Quantity':12},
                        {'Customer':'Ande','Product_Id':8931,'Quantity':6},
                        {'Customer':'Sam','Product_Id':4109,'Quantity':2}])

In [46]:
product

   Price     Product  Product_Id
0    5.0  Sushi Roll        4109
1    0.5         Egg        1412
2    1.5       Bagel        8931

In [47]:
invoice

  Customer  Product_Id  Quantity
0      Ali        4109         1
1     Eric        1412        12
2     Ande        8931         6
3      Sam        4109         2

In [49]:
product = product.set_index('Product_Id')

In [51]:
product

            Price     Product
Product_Id
4109          5.0  Sushi Roll
1412          0.5         Egg
8931          1.5       Bagel

In [52]:
invoice = invoice.set_index('Product_Id')

In [53]:
invoice

           Customer  Quantity
Product_Id
4109            Ali         1
1412           Eric        12
8931           Ande         6
4109            Sam         2

In [72]:
Prod_invoice = product.merge(invoice,how='outer',left_on='Product_Id',right_on='Product_Id')

In [73]:
Prod_invoice

            Price     Product Customer  Quantity
Product_Id
4109          5.0  Sushi Roll      Ali         1
4109          5.0  Sushi Roll      Sam         2
1412          0.5         Egg     Eric        12
8931          1.5       Bagel     Ande         6

In [74]:
Prod_invoice = Prod_invoice.reset_index()

In [75]:
Prod_invoice

   Product_Id  Price     Product Customer  Quantity
0        4109    5.0  Sushi Roll      Ali         1
1        4109    5.0  Sushi Roll      Sam         2
2        1412    0.5         Egg     Eric        12
3        8931    1.5       Bagel     Ande         6

In [76]:
Prod_invoice = Prod_invoice.set_index(['Product_Id','Product'])

In [77]:
Prod_invoice

                       Price Customer  Quantity
Product_Id Product
4109       Sushi Roll    5.0      Ali         1
           Sushi Roll    5.0      Sam         2
1412       Egg           0.5     Eric        12
8931       Bagel         1.5     Ande         6

In [78]:
Prod_invoice['Total'] = Prod_invoice['Price'] * Prod_invoice['Quantity']

In [79]:
Prod_invoice

                       Price Customer  Quantity  Total
Product_Id Product
4109       Sushi Roll    5.0      Ali         1    5.0
           Sushi Roll    5.0      Sam         2   10.0
1412       Egg           0.5     Eric        12    6.0
8931       Bagel         1.5     Ande         6    9.0

groupby returns two values one is the group categories and other is the frame

In [80]:
invoice

           Customer  Quantity
Product_Id
4109            Ali         1
1412           Eric        12
8931           Ande         6
4109            Sam         2

In [82]:
group_invoice = invoice.groupby('Product_Id')

In [84]:
for group, frame in group_invoice:
    print(group)
    print(frame)

group_invoice['Quantity'].mean()

1412
           Customer  Quantity
Product_Id
1412           Eric        12
4109
           Customer  Quantity
Product_Id
4109            Ali         1
4109            Sam         2
8931
           Customer  Quantity
Product_Id
8931           Ande         6

Product_Id
1412    12.0
4109     1.5
8931     6.0
Name: Quantity, dtype: float64

Adding Category time to limit the valuees as well as store the order
a) nominal Data  - astype('category')
b) ordinal Data - astype('category',categories = ['a','b'],ordered = True)

In [85]:
s = pd.Series(['Low', 'Low', 'High', 'Medium', 'Low', 'High', 'Low'])
s

0       Low
1       Low
2      High
3    Medium
4       Low
5      High
6       Low
dtype: object

In [88]:
s.astype('category',categories=['low','Medium','High'], ordered=True)

C:\Users\Upend\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: specifying 'categories' or 'ordered' in .astype() is deprecated; pass a CategoricalDtype instead
  """Entry point for launching an IPython kernel.

0       NaN
1       NaN
2      High
3    Medium
4       NaN
5      High
6       NaN
dtype: category
Categories (3, object): [low < Medium < High]

#cut is used to divide the data into different catogories based on the bin size

In [91]:
s = pd.Series([168, 180, 174, 190, 170, 185, 179, 181, 175, 169, 182, 177, 180, 171])
pd.cut(s,3)

0     (167.978, 175.333]
1     (175.333, 182.667]
2     (167.978, 175.333]
3       (182.667, 190.0]
4     (167.978, 175.333]
5       (182.667, 190.0]
6     (175.333, 182.667]
7     (175.333, 182.667]
8     (167.978, 175.333]
9     (167.978, 175.333]
10    (175.333, 182.667]
11    (175.333, 182.667]
12    (175.333, 182.667]
13    (167.978, 175.333]
dtype: category
Categories (3, interval[float64]): [(167.978, 175.333] < (175.333, 182.667] < (182.667, 190.0]]

In [92]:
pd.cut(s, 3, labels=['Small', 'Medium', 'Large'])

0      Small
1     Medium
2      Small
3      Large
4      Small
5      Large
6     Medium
7     Medium
8      Small
9      Small
10    Medium
11    Medium
12    Medium
13     Small
dtype: category
Categories (3, object): [Small < Medium < Large]

In [94]:
s = pd.Series(list('aaabbbccddefgh')).astype('category')

In [95]:
s

0     a
1     a
2     a
3     b
4     b
5     b
6     c
7     c
8     d
9     d
10    e
11    f
12    g
13    h
dtype: category
Categories (8, object): [a, b, c, d, e, f, g, h]

In [96]:
pd.get_dummies(s)

    a  b  c  d  e  f  g  h
0   1  0  0  0  0  0  0  0
1   1  0  0  0  0  0  0  0
2   1  0  0  0  0  0  0  0
3   0  1  0  0  0  0  0  0
4   0  1  0  0  0  0  0  0
5   0  1  0  0  0  0  0  0
6   0  0  1  0  0  0  0  0
7   0  0  1  0  0  0  0  0
8   0  0  0  1  0  0  0  0
9   0  0  0  1  0  0  0  0
10  0  0  0  0  1  0  0  0
11  0  0  0  0  0  1  0  0
12  0  0  0  0  0  0  1  0
13  0  0  0  0  0  0  0  1

#Pivot Table for data visualization with groups
print(pd.pivot_table(Bikes, index=['Manufacturer','Bike Type']))

Bikes.pivot_table(values=['Price','Rating'], index='Manufacturer',columns ='Bike Type',aggfunc=np.mean)